Функция ПолучитьВыборку(ДатаАктуальности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриоритетыСкладовСрезПоследних.Приоритет КАК Приоритет,
	|	ПриоритетыСкладовСрезПоследних.Склад
	|ИЗ
	|	РегистрСведений.ПриоритетыСкладов.СрезПоследних(&ДатаАктуальности, ) КАК ПриоритетыСкладовСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	ВыборкаСкладов = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаСкладов;
	
КонецФункции
